[
  {
    "id": 1,
    "title": "How Trident Organized the Best Ganesh Chaturthi",
    "short_description": "Here’s everything that unfolded during Ganesh Chaturthi at Trident—from a grand procession to 11 days of devotion, dance, and unforgettable chaos",
    "long_description": "<p><strong>Dearest Residents of Hostel Trident,</strong></p><p>It has come to my attention that this year’s Ganesh Chaturthi celebration was nothing short of a spectacle—a delightful blend of devotion, drama, and the unmistakable chaos that only Trident can create.</p><p>The festivities commenced with a grand procession worthy of the finest attention. Bappa was welcomed with dhol–taasha thundering through the corridors, vibrant gulal painting the air, and every resident dancing with a joy that even the walls could feel. One could say, the arrival itself set the tone for the magic that followed.</p><p>Soon after, the idol found its home in the mess area, where the <em>sthapana</em> took place with grace and enthusiasm. The Mess Team, ever generous, prepared a special lunch that left hearts—and stomachs—full. And thus began the eleven days of devotion. Every morning and every evening, the sound of the aarti echoed gently through our hostel, inviting peace into the daily bustle of student life.</p><p>But, as all good tales go, the end was as grand as the beginning. Visarjan day arrived with campus-wide fervor that could rival a royal parade. Students from every hostel gathered behind the van carrying all the idols—united in beats of the dhol, showers of gulal, and a joyful chaos that could possibly be heard all the way to Dean's Home (if one listens closely).</p><p>And for those who believe festivities end with rituals—oh, how mistaken you are. On the eve of August 31st, Trident hosted a spirited Cards Night, where strategies were plotted, alliances formed, and friendships tested over every shuffle of the deck.</p><p>In conclusion, dear readers, this Ganesh Chaturthi was not merely an event. It was a season—full of laughter, devotion, colour, community, and the unmistakable charm that makes Trident what it is.</p><p><em>Yours in celebration,</em></p><p><strong>The Observer of All Things, Delightfully Trident</strong></p>",
    "image": "images/blog/ganesh.jpeg",
    "published_at": "08-09-2025"
  },
  {
    "id": 2,
    "title": "All you need to know about Sustainability Competition 2025",
    "short_description": "Got ideas to make Trident greener? Here’s everything you need to know about the Sustainability Competition 2025!",
    "long_description": "<p><strong>Dearest Residents of Hostel Trident,</strong></p><p>It appears that innovation is once again fluttering through the corridors of our beloved hostel, carried by none other than the highly anticipated <strong>Sustainability Competition 2025</strong>. One cannot help but admire the ambition of our bright young minds, eager to transform Trident into a greener, smarter, and decidedly more refined place to live.</p><p>This season, the challenge is centred around the noble principles of <strong>Reduce, Reuse, and Recycle</strong> — concepts as timeless as they are crucial. Whether your vision involves reducing waste, reinventing discarded treasures, or establishing a recycling system worthy of admiration, the Council eagerly awaits proposals that are both elegant in thought and practical in execution.</p><p>Participants may choose to embark on this journey alone or form alliances with trusted companions. Yet, let it be known: every proposal must be accompanied by two essential elements —</p><ul><li>a clear and cleverly designed <strong>execution plan</strong>, and</li><li>a meticulously crafted <strong>budget</strong> not exceeding <strong>₹2,00,000</strong>.</li></ul><p>A few dates, my dear readers, must not slip from your memory:</p><ul><li><strong>15th December 2025</strong> — the final day to submit your brilliant ideas</li><li><strong>January 2026</strong> — the grand unveiling of results</li><li><strong>Submission Link:</strong><a href=\"https://forms.gle/ZvcEGZrfp7ujZcfT9\" target=\"_blank\">Click here to Submit</a></li></ul><p>And of course, no competition at Trident is complete without rewards worthy of celebration. This year, the victors shall receive:</p><ul><li>🥇 <strong>₹10,000</strong> for the finest proposal</li><li>🥈 <strong>₹8,000</strong> for the distinguished runner-up</li><li>🥉 <strong>₹5,000</strong> for the gracious third place</li></ul><p><em>The prizes, I must note, are awarded per entry — so teams, choose your confidantes with utmost care.</em></p><p>So sharpen your quills, steady your minds, and prepare your finest ideas. For the future of Hostel 15 is ready to be rewritten, and perhaps — just perhaps — your proposal shall be the one to set a new standard for sustainable living.</p><p><strong>Yours in utmost curiosity,</strong><br><em>The Observer of All Things Delightfully Trident</em></p>",
    "image": "images/blog/sustainability_competition.jpeg",
    "published_at": "05-11-2025"
  },
  {
    "id": 3,
    "title": "How to lodge a complaint at Trident?",
    "short_description": "Confused about where to complain and how to actually get things fixed? Here’s your all-in-one Trident guide to solving problems without the chaos.",
    "long_description": "<p><em>Dearest Tridents,</em></p><p>It has come to this author’s attention that while our hostel is a vibrant palace of friendship, festivity, and last-minute deadlines, it is occasionally interrupted by the great villains of student life: leaking taps, flickering tube lights, mysteriously jammed doors, and the ever-controversial mess food mishaps.</p><p>And in such moments of distress, one must know not just <em>whom</em> to blame, but <em>where</em> to complain. Fear not, for this guide promises to transform even the most bewildered resident into a confident connoisseur of complaint-lodging.</p><p>If your troubles lie in the realm of maintenance—creaking beds, faulty switches, or taps that behave like fountains—your first stop is the venerable <strong>Complaint Book</strong> at the Hall Manager’s office.</p><p>For electrical, plumbing, or carpentry issues, the kingdom offers a modern weapon: <strong>support.iitb.ac.in</strong>. A few clicks and your grievance is officially in the system.</p><p>Should your concerns be about the mess—undercooked, overcooked, or questionably cooked— and if the Mess Manager is available, report the issue immediately, document it in the <strong>Feedback Register</strong>, attach a photo, and collect a signature. Then proceed to the Mess Council or Warden.</p><p>If the Mess Manager is not present, report to the serving counter staff, register the complaint with photographic proof, and obtain their signature before escalating the matter.</p><p>If no one acknowledges your plea, approach the Hall Manager. Record the refusal in the Feedback Register, secure a signature, gather your proof, and present your case to the Mess Council or Warden.</p><p><em>May this guide be your torch in the labyrinth of repairs, signatures, and grievances.<br>—Your Ever-Observant Chronicler</em></p>",
    "image": "images/blog/complaint.webp",
    "published_at": "05-08-2025"
  },
  {
    "id": 4,
    "title": "Diwali Celebrations at Trident",
    "short_description": "A sparkling recap of the three-day Diwali weekend at Trident — from mehendi and movies to board games, rangoli, karaoke, and a serene Laxmi Pooja.",
    "long_description": "<p><strong>Dearest Residents of Hostel Trident,</strong></p><p>Diwali, the festival of lights, has once again cast its golden glow upon our beloved home. And as always, Trident proved that when it comes to celebration, we settle for nothing short of brilliance. With diyas glowing, fairy lights twinkling, and joy humming gently through every corridor, our hostel transformed into a sight that could leave even the stars themselves a little envious. </p><p>Allow me now to recount what unfolded over this most enchanting three-day Diwali weekend.</p><p>The festivities commenced on Saturday, with a <strong>Mehendi & Movie Night</strong> that turned the lounge room into a dreamy haven. Soft fairy lights draped the walls, mattresses lined the floor, and mehendi cones passed from hand to hand as girls adorned each other with intricate designs. And what better cinematic companion than the evergreen charm of <em>Dilwale Dulhania Le Jayenge</em>? Laughter echoed, dancing erupted whenever Raj and Simran graced the screen, and bowls of popcorn made their way through the crowd like treasured offerings.</p><p>Sunday arrived with equal enthusiasm, bringing with it a lively <strong>Board Games & Rangoli Night</strong>.A cozy corner of the mess shone under warm lights as Monopoly, Ludo, Shaasan, and Bollywood-themed playing cards awaited their next champions. Meanwhile, a beautiful rangoli began taking shape — petal by petal, colour by colour — as talented hands worked their magic. Soon enough, the night transformed into an impromptu karaoke gathering: voices rising with confidence, speakers booming with favourite songs, and the mic passed around like a crown of temporary stardom.</p><p>Finally, on Monday — the day of Diwali itself — the celebrations found their peaceful crescendo with a serene <strong>Laxmi Pooja</strong> in the mess. Surrounded by light, devotion, and quiet warmth,the ritual blessed our hostel with prosperity and togetherness that lingered long after the final diya dimmed.</p><p>Thus, dear readers, concluded Trident’s radiant Diwali weekend: three days of colour, music, laughter, devotion, and memoriesthat shall no doubt live fondly in the hearts of all who witnessed them.</p><p><strong>Yours in festive admiration,</strong><br><em>The Observer of All Things Delightfully Trident</em></p>",
    "image": "images/blog/diwali.jpeg",
    "published_at": "21-10-2025"
  },
  {
    "id": 5,
    "title": "Dahi Handi Redefined",
    "short_description": "A midnight Janmashtami twist you never expected — Trident’s girls reinvented Dahi Handi in the most delightful way. Curious how it unfolded? Start reading!",
    "long_description": "<p><em>Dearest Tridents,</em></p><p>It seems the ever-spirited residents of Hostel 15 have once again proven that tradition, when placed in their hands, transforms into something far more enchanting. As the clock struck midnight on Janmashtami, long before the campus slipped fully into slumber, an unusual excitement began brewing in our mess.</p><p>This year, our clever young ladies decided that the age-old tradition of climbing human pyramids for Dahi Handi deserved a Trident-style makeover—one that was far less bruising and far more entertaining. And thus, a new chapter of festivities was born.</p><p>A modest earthen pot was tied just high enough to stretch for, not scramble toward. But do not be fooled by its gentle height—chaos still found its way. Pairs of girls stepped forward, one blindfolded and armed with a stick, the other entrusted with guiding her companion <em>only</em> through words. No touching, no nudging—just trust, instinct, and occasionally, wildly miscalculated directions.</p><p>The crowd swelled quickly, cheers echoing through the midnight air as each duo attempted their heroic (and often hilarious) journey. At one point, dear reader, a particularly determined participant swung with such passion that the stick snapped—a tragic end for the pot, but a triumphant moment for laughter.</p><p>Yet beneath all the fun, a familiar truth shimmered gently: happiness often arrives disguised as shared giggles, festive madness, and the simple joy of being surrounded by glowing faces. And if festivals serve one purpose, it is this— to coax out the happiness we sometimes forget we carry.</p><p><em>Until the next celebration,<br>—Your Ever-Observant Chronicler</em></p>",
    "image": "images/blog/dahi handi.webp",
    "published_at": "16-08-2025"
  }
]
